In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [4]:
df = df.drop(['PassengerId','Name','Ticket','Cabin'],axis=1)

In [5]:
df

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [6]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [7]:
from sklearn.preprocessing import LabelEncoder

In [8]:
le_sex = LabelEncoder()
le_Embarked = LabelEncoder()

In [9]:
df['sex'] = le_sex.fit_transform(df['Sex'])

In [28]:
for i in range(df.shape[0]):
    if df['Embarked'].iloc[i] == 'S':
        df['Embarked'].iloc[i] == '1'

In [21]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked  sex
0         0       3    male  22.0      1      0   7.2500        S    1
1         1       1  female  38.0      1      0  71.2833        C    0
2         1       3  female  26.0      0      0   7.9250        S    0
3         1       1  female  35.0      1      0  53.1000        S    0
4         0       3    male  35.0      0      0   8.0500        S    1

In [29]:
df.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
SibSp         int64
Parch         int64
Fare        float64
Embarked     object
sex           int64
dtype: object

In [30]:
df = df.drop(['Sex','Embarked'],axis=1)

In [31]:
df

     Survived  Pclass   Age  SibSp  Parch     Fare  sex
0           0       3  22.0      1      0   7.2500    1
1           1       1  38.0      1      0  71.2833    0
2           1       3  26.0      0      0   7.9250    0
3           1       1  35.0      1      0  53.1000    0
4           0       3  35.0      0      0   8.0500    1
..        ...     ...   ...    ...    ...      ...  ...
886         0       2  27.0      0      0  13.0000    1
887         1       1  19.0      0      0  30.0000    0
888         0       3   NaN      1      2  23.4500    0
889         1       1  26.0      0      0  30.0000    1
890         0       3  32.0      0      0   7.7500    1

[891 rows x 7 columns]

In [33]:
df.isna().sum()

Survived      0
Pclass        0
Age         177
SibSp         0
Parch         0
Fare          0
sex           0
dtype: int64

In [34]:
import math
median_age = math.floor(df['Age'].median())

In [35]:
median_age

28

In [36]:
df['Age'] = df['Age'].fillna(median_age)

In [37]:
df.isna().sum()

Survived    0
Pclass      0
Age         0
SibSp       0
Parch       0
Fare        0
sex         0
dtype: int64

In [38]:
df.dtypes

Survived      int64
Pclass        int64
Age         float64
SibSp         int64
Parch         int64
Fare        float64
sex           int64
dtype: object

In [39]:
df['Age'] = df['Age'].astype(int)
df['Fare'] = df['Fare'].astype(int)

In [40]:
df.dtypes

Survived    int64
Pclass      int64
Age         int64
SibSp       int64
Parch       int64
Fare        int64
sex         int64
dtype: object

In [41]:
X = df.drop('Survived',axis=1)

In [42]:
X

     Pclass  Age  SibSp  Parch  Fare  sex
0         3   22      1      0     7    1
1         1   38      1      0    71    0
2         3   26      0      0     7    0
3         1   35      1      0    53    0
4         3   35      0      0     8    1
..      ...  ...    ...    ...   ...  ...
886       2   27      0      0    13    1
887       1   19      0      0    30    0
888       3   28      1      2    23    0
889       1   26      0      0    30    1
890       3   32      0      0     7    1

[891 rows x 6 columns]

In [43]:
Y = df.Survived

In [44]:
Y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [46]:
from sklearn import tree

In [47]:
model = tree.DecisionTreeClassifier()

In [48]:
model.fit(X,Y)

DecisionTreeClassifier(ccp_alpha=0.0, class_weight=None, criterion='gini',
                       max_depth=None, max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort='deprecated',
                       random_state=None, splitter='best')

In [49]:
model.score(X,Y)

0.9528619528619529

In [53]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_tets = train_test_split(X,Y,test_size = 0.2)

In [54]:
from sklearn.linear_model import LogisticRegression
le = LogisticRegression()
model = le.fit(x_train,y_train)
model

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=None, solver='lbfgs', tol=0.0001, verbose=0,
                   warm_start=False)

In [55]:
model.predict(x_test)

array([1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 1, 1, 0,
       0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 1, 1])

In [57]:
model.score(x_test,y_tets)

0.7821229050279329